jako-dev/bvg-display/esp32/src/main.cpp
/**
 * BVG Departure Display - ESP32 Firmware
 * 
 * Features:
 * - HUB75 LED Matrix (128x32) via DMA
 * - WiFi captive portal for initial setup
 * - Web interface for station configuration
 * - Real-time BVG departure data
 */

#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <ESPAsyncWebServer.h>
#include <DNSServer.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <Update.h>
#include <esp_ota_ops.h>
#include <esp_task_wdt.h>
#include <ESPmDNS.h>

#include "config.h"
#include "font.h"
#include "web_portal.h"

// ===== Globals =====
MatrixPanel_I2S_DMA* matrix = nullptr;
AsyncWebServer server(80);
DNSServer dnsServer;
Preferences prefs;

// State
enum AppMode { MODE_AP_SETUP, MODE_RUNNING };
AppMode appMode = MODE_AP_SETUP;

struct Station {
    String id;
    String name;
    int walkTime;  // Minutes to walk to this station
};

struct Departure {
    String lineName;
    String direction;
    String product;
    int minutesUntil;
    int delaySeconds;
    bool cancelled;
};

Station stations[MAX_STATIONS];
int stationCount = 0;
int activeStationIdx = 0;
Departure departures[BVG_MAX_DEPARTURES];
int departureCount = 0;
int depCountSetting = 6;
bool scrollEnabled = false;       // Scroll disabled by default: show first 3
int scrollSpeedSetting = 3000;    // ms between scroll steps

String wifiSSID = "";
String wifiPassword = "";
unsigned long lastFetchTime = 0;

// Sleep mode
bool sleepEnabled = false;
int sleepStartHour = 22;  // 0-23
int sleepEndHour = 6;     // 0-23
bool displaySleeping = false;

// Brightness
int brightnessSetting = 80;  // 0-255

// API provider
String apiHost = BVG_API_HOST_DEFAULT;

// Transport type filters — mirrors the web app's filter set so the ESP32
// board and the browser show the same lines when both are configured.
struct TransportFilters {
    bool suburban = true;
    bool subway = true;
    bool tram = true;
    bool bus = true;
    bool ferry = true;
    bool express = true;
    bool regional = true;
};
TransportFilters filters;

// ===== Config Page Authentication =====
// Off by default — the device works exactly as before until the user opts
// in from the portal's "Sicherheit" card. When enabled, standard HTTP Basic
// Auth guards the config page and every state-changing endpoint; captive
// portal detection and read-only status/version endpoints stay open so the
// initial WiFi setup flow keeps working.
#define AUTH_USERNAME "admin"
bool authEnabled = false;
String authPassword = "";

// Appends the filter query params shared by every departures request.
String filterQueryParams() {
    String q;
    q += "&suburban=" + String(filters.suburban ? "true" : "false");
    q += "&subway="   + String(filters.subway   ? "true" : "false");
    q += "&tram="     + String(filters.tram     ? "true" : "false");
    q += "&bus="      + String(filters.bus      ? "true" : "false");
    q += "&ferry="    + String(filters.ferry    ? "true" : "false");
    q += "&express="  + String(filters.express  ? "true" : "false");
    q += "&regional=" + String(filters.regional ? "true" : "false");
    return q;
}

// Stale data tracking
unsigned long lastSuccessfulFetch = 0;  // millis() of last successful API response
#define STALE_DATA_THRESHOLD 300000     // 5 minutes in ms

// Factory reset button
#define RESET_BUTTON_PIN 0  // BOOT button on most ESP32 dev boards
#define RESET_HOLD_TIME 5000  // Hold 5 seconds to factory reset

// ===== Deferred work =====
// AsyncWebServer callbacks run on the AsyncTCP task. That task has a small
// stack and must never block: an HTTPS request there stalls every other
// connection for the duration of the TLS handshake and can overflow the stack.
// Handlers therefore queue the work and loop() carries it out.
enum JobType { JOB_NONE, JOB_STATION_SEARCH, JOB_FIRMWARE_CHECK };
JobType jobType = JOB_NONE;
String jobParam;
String jobResult;
int jobHttpCode = 0;
bool jobFinished = false;
unsigned long jobFinishedAt = 0;
#define JOB_RESULT_TTL 60000  // ms a finished result is kept if nobody polls

// Reboots are also deferred, so the HTTP response is actually flushed first.
unsigned long pendingRebootAt = 0;
bool pendingFactoryReset = false;
#define REBOOT_DELAY 800  // ms to let the response drain before restarting

// Set at the start of each /api/firmware/upload request once checkAuth()
// passes; both of that endpoint's callbacks consult it (see the handler).
bool otaUploadAuthorized = false;

unsigned long lastScrollTime = 0;
unsigned long lastWifiCheck = 0;
int scrollOffset = 0;
bool ntpSynced = false;

// ===== Forward Declarations =====
void setupMatrix();
void setupAP();
void setupWebServer();
void connectWiFi();
void checkWiFiReconnect();
void syncNTP();
void fetchDepartures();
void parseDeparturesAppend(Stream& stream);
void sortDepartures();
void renderDisplay();
void renderDepartureRow(const Departure& dep, int y);
void renderSetupScreen();
void renderTextCentered(const char* text, uint16_t color);
void loadSettings();
void saveSettings();
void factoryReset();
uint16_t getLineColor(const String& product, const String& lineName);
String urlEncode(const String& str);
void processPendingJob();
void runStationSearch();
void runFirmwareCheck();
bool checkAuth(AsyncWebServerRequest* request);

// ===== Setup =====
void setup() {
    Serial.begin(115200);
    Serial.println("\n=== Abfahrtsmonitor Starting ===");

    // Factory reset button (BOOT pin)
    pinMode(RESET_BUTTON_PIN, INPUT_PULLUP);

    setupMatrix();
    loadSettings();
    matrix->setBrightness8(brightnessSetting);

    if (wifiSSID.length() > 0) {
        // Try connecting to saved WiFi
        renderTextCentered("Verbinde...", matrix->color565(255, 204, 0));
        connectWiFi();
    }

    if (WiFi.status() != WL_CONNECTED) {
        // Check if this is an OTA update that can't connect — rollback
        const esp_partition_t* running = esp_ota_get_running_partition();
        esp_ota_img_states_t ota_state;
        if (esp_ota_get_state_partition(running, &ota_state) == ESP_OK) {
            if (ota_state == ESP_OTA_IMG_PENDING_VERIFY) {
                Serial.println("[OTA] WiFi failed after update — rolling back!");
                esp_ota_mark_app_invalid_rollback_and_reboot();
                // Does not return
            }
        }
        // Normal case: start AP mode for configuration
        appMode = MODE_AP_SETUP;
        setupAP();
    } else {
        appMode = MODE_RUNNING;
        // Mark firmware as valid (confirms OTA if pending)
        esp_ota_mark_app_valid_cancel_rollback();
        Serial.println("[OTA] Firmware confirmed valid");
        syncNTP();

        // Start mDNS
        if (MDNS.begin("abfahrtsmonitor")) {
            MDNS.addService("http", "tcp", 80);
            Serial.println("[mDNS] http://abfahrtsmonitor.local");
        }
    }

    setupWebServer();

    // Enable hardware watchdog (60 second timeout).
    // The init signature changed in ESP-IDF 5 / arduino-esp32 3.x.
#if ESP_IDF_VERSION_MAJOR >= 5
    esp_task_wdt_config_t wdtConfig = {
        .timeout_ms = 60000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_init(&wdtConfig);
#else
    esp_task_wdt_init(60, true);
#endif
    esp_task_wdt_add(NULL);

