jako-dev/bvg-display/esp32/src/main.cpp
    Serial.println("Setup complete. Mode: " + String(appMode == MODE_AP_SETUP ? "AP Setup" : "Running"));
}

// ===== Loop =====
void loop() {
    // Feed watchdog
    esp_task_wdt_reset();

    // Deferred reboot requested by a web handler
    if (pendingRebootAt != 0 && millis() >= pendingRebootAt) {
        pendingRebootAt = 0;
        if (pendingFactoryReset) factoryReset();
        else ESP.restart();
    }

    // Network work handed over by the (non-blocking) web handlers
    processPendingJob();

    // Check factory reset button (BOOT button held for 5 seconds)
    static unsigned long resetBtnStart = 0;
    if (digitalRead(RESET_BUTTON_PIN) == LOW) {
        if (resetBtnStart == 0) resetBtnStart = millis();
        if (millis() - resetBtnStart >= RESET_HOLD_TIME) {
            factoryReset();
        }
    } else {
        resetBtnStart = 0;
    }

    if (appMode == MODE_AP_SETUP) {
        dnsServer.processNextRequest();
        renderSetupScreen();
        delay(100);
        return;
    }

    // Running mode
    unsigned long now = millis();

    // Check WiFi connectivity every 30s
    if (now - lastWifiCheck >= 30000) {
        checkWiFiReconnect();
        lastWifiCheck = now;
    }

    // Check sleep mode
    if (sleepEnabled && ntpSynced) {
        struct tm timeinfo;
        if (getLocalTime(&timeinfo)) {
            int h = timeinfo.tm_hour;
            bool shouldSleep;
            if (sleepStartHour <= sleepEndHour) {
                // e.g. 8-17 (sleep during the day)
                shouldSleep = (h >= sleepStartHour && h < sleepEndHour);
            } else {
                // e.g. 22-6 (sleep overnight, typical)
                shouldSleep = (h >= sleepStartHour || h < sleepEndHour);
            }
            if (shouldSleep && !displaySleeping) {
                displaySleeping = true;
                matrix->clearScreen();
                Serial.println("[Sleep] Display off");
            } else if (!shouldSleep && displaySleeping) {
                displaySleeping = false;
                lastFetchTime = 0; // Trigger immediate refresh on wake
                Serial.println("[Sleep] Display on");
            }
        }
    } else if (!sleepEnabled && displaySleeping) {
        displaySleeping = false;
        lastFetchTime = 0;
    }

    // Skip fetch and render while sleeping
    if (displaySleeping) {
        delay(1000);
        return;
    }

    // Fetch departures periodically
    if (now - lastFetchTime >= BVG_REFRESH_INTERVAL || lastFetchTime == 0) {
        if (WiFi.status() == WL_CONNECTED && ntpSynced) {
            fetchDepartures();
        }
        lastFetchTime = now;
    }

    // Scroll display
    if (now - lastScrollTime >= SCROLL_SPEED) {
        renderDisplay();
        lastScrollTime = now;
    }

    delay(10);
}

// ===== Matrix Setup =====
void setupMatrix() {
    HUB75_I2S_CFG mxconfig(PANEL_WIDTH, PANEL_HEIGHT, PANELS_NUMBER);
    
    mxconfig.gpio.r1 = R1_PIN;
    mxconfig.gpio.g1 = G1_PIN;
    mxconfig.gpio.b1 = B1_PIN;
    mxconfig.gpio.r2 = R2_PIN;
    mxconfig.gpio.g2 = G2_PIN;
    mxconfig.gpio.b2 = B2_PIN;
    mxconfig.gpio.a = A_PIN;
    mxconfig.gpio.b = B_PIN;
    mxconfig.gpio.c = C_PIN;
    mxconfig.gpio.d = D_PIN;
    mxconfig.gpio.e = E_PIN;
    mxconfig.gpio.lat = LAT_PIN;
    mxconfig.gpio.oe = OE_PIN;
    mxconfig.gpio.clk = CLK_PIN;

    mxconfig.clkphase = false;
    mxconfig.driver = HUB75_I2S_CFG::FM6126A;

    matrix = new MatrixPanel_I2S_DMA(mxconfig);
    matrix->begin();
    matrix->setBrightness8(80);  // Default, overridden after loadSettings()
    matrix->clearScreen();
}

// ===== WiFi =====
void setupAP() {
    WiFi.mode(WIFI_AP);
    WiFi.softAP(AP_SSID, AP_PASSWORD);
    
    // Start DNS server for captive portal (redirect all to us)
    dnsServer.start(53, "*", WiFi.softAPIP());
    
    Serial.print("AP started. IP: ");
    Serial.println(WiFi.softAPIP());
}

void connectWiFi() {
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.begin(wifiSSID.c_str(), wifiPassword.c_str());
    
    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_CONNECT_TIMEOUT) {
        delay(250);
        Serial.print(".");
    }
    
    if (WiFi.status() == WL_CONNECTED) {
        Serial.println("\nWiFi connected: " + WiFi.localIP().toString());
    } else {
        Serial.println("\nWiFi connection failed");
        WiFi.disconnect();
    }
}

void checkWiFiReconnect() {
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("WiFi lost, reconnecting...");
        WiFi.disconnect();
        WiFi.begin(wifiSSID.c_str(), wifiPassword.c_str());
        unsigned long start = millis();
        while (WiFi.status() != WL_CONNECTED && millis() - start < 5000) {
            delay(100);
        }
        if (WiFi.status() == WL_CONNECTED) {
            Serial.println("WiFi reconnected: " + WiFi.localIP().toString());
        }
    }
}

void syncNTP() {
    configTzTime("CET-1CEST,M3.5.0,M10.5.0/3", "pool.ntp.org", "time.nist.gov");
    Serial.print("Syncing NTP");
    int attempts = 0;
    struct tm timeinfo;
    while (!getLocalTime(&timeinfo) && attempts < 10) {
        Serial.print(".");
        delay(500);
        attempts++;
    }
    if (attempts < 10) {
        ntpSynced = true;
        Serial.println(" OK");
    } else {
        ntpSynced = true; // Allow operation with potentially wrong time
        Serial.println(" TIMEOUT (proceeding anyway)");
    }
}

// Guards a handler behind HTTP Basic Auth once the user has enabled it in
// the portal's "Sicherheit" card. A no-op while auth is off (the default),
// so existing devices behave exactly as before until someone opts in.
// The settings handler only ever lets authEnabled become true together with
// a non-empty password, so there is no "enabled but no password" state here.
bool checkAuth(AsyncWebServerRequest* request) {
    if (!authEnabled) return true;
    if (!request->authenticate(AUTH_USERNAME, authPassword.c_str())) {
        request->requestAuthentication();
        return false;
    }
    return true;
}

// ===== Web Server =====
void setupWebServer() {
    // Serve the configuration page
    server.on("/", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        // Served straight from flash — no ~20KB heap copy per request
        request->send_P(200, "text/html", PORTAL_HTML);
    });

