jako-dev/bvg-display/esp32/src/main.cpp
    // Captive portal detection endpoints
    server.on("/generate_204", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->redirect("/");
    });
    server.on("/hotspot-detect.html", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->redirect("/");
    });
    server.on("/fwlink", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->redirect("/");
    });

    // API: Get current status
    server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        JsonDocument doc;
        doc["mode"] = (appMode == MODE_AP_SETUP) ? "setup" : "running";
        doc["wifi_connected"] = (WiFi.status() == WL_CONNECTED);
        doc["wifi_ssid"] = wifiSSID;
        doc["ip"] = WiFi.localIP().toString();
        doc["hostname"] = "abfahrtsmonitor.local";
        doc["station_count"] = stationCount;
        doc["departure_count"] = departureCount;
        doc["uptime_seconds"] = millis() / 1000;
        doc["data_stale"] = (lastSuccessfulFetch > 0 && millis() - lastSuccessfulFetch > STALE_DATA_THRESHOLD);
        doc["free_heap"] = ESP.getFreeHeap();
        
        JsonArray stArr = doc["stations"].to<JsonArray>();
        for (int i = 0; i < stationCount; i++) {
            JsonObject st = stArr.add<JsonObject>();
            st["id"] = stations[i].id;
            st["name"] = stations[i].name;
            st["walk_time"] = stations[i].walkTime;
        }

        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });

    // API: Save WiFi credentials
    server.on("/api/wifi", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (request->hasParam("ssid", true) && request->hasParam("password", true)) {
            wifiSSID = request->getParam("ssid", true)->value();
            wifiPassword = request->getParam("password", true)->value();
            saveSettings();
            request->send(200, "application/json", "{\"ok\":true,\"msg\":\"WiFi saved. Restarting...\"}");
            pendingRebootAt = millis() + REBOOT_DELAY;
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing ssid or password\"}");
        }
    });

    // API: Scan WiFi networks.
    // Kicks off an asynchronous scan and reports "pending" until it finishes —
    // a synchronous scan would block the web server for several seconds.
    server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        int n = WiFi.scanComplete();
        if (n == WIFI_SCAN_RUNNING) {
            request->send(200, "application/json", "{\"status\":\"pending\"}");
            return;
        }
        if (n == WIFI_SCAN_FAILED) {
            WiFi.scanNetworks(true);  // async
            request->send(200, "application/json", "{\"status\":\"pending\"}");
            return;
        }

        JsonDocument doc;
        doc["status"] = "done";
        JsonArray networks = doc["networks"].to<JsonArray>();
        for (int i = 0; i < n && i < 20; i++) {
            JsonObject net = networks.add<JsonObject>();
            net["ssid"] = WiFi.SSID(i);
            net["rssi"] = WiFi.RSSI(i);
            net["encrypted"] = (WiFi.encryptionType(i) != WIFI_AUTH_OPEN);
        }
        WiFi.scanDelete();
        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });

    // API: Search BVG stations (proxied so the browser doesn't need CORS).
    // The actual HTTPS call happens in loop(); the client polls /api/job.
    server.on("/api/stations/search", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (!request->hasParam("q")) {
            request->send(400, "application/json", "{\"error\":\"Missing q param\"}");
            return;
        }
        if (WiFi.status() != WL_CONNECTED) {
            request->send(503, "application/json", "{\"error\":\"WiFi not connected\"}");
            return;
        }
        if (jobType != JOB_NONE) {
            request->send(429, "application/json", "{\"error\":\"Busy, try again\"}");
            return;
        }
        jobParam = request->getParam("q")->value();
        jobResult = "";
        jobHttpCode = 0;
        jobFinished = false;
        jobType = JOB_STATION_SEARCH;
        request->send(202, "application/json", "{\"status\":\"pending\"}");
    });

    // API: Poll the result of the queued network job
    server.on("/api/job", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (jobFinished) {
            String body = "{\"status\":\"done\",\"code\":" + String(jobHttpCode) + ",\"data\":" +
                          (jobResult.length() ? jobResult : "null") + "}";
            request->send(200, "application/json", body);
            // One-shot: clear so the next request can queue work. jobType is
            // reset first — otherwise processPendingJob() could observe
            // "queued but not finished" and run the job all over again.
            jobType = JOB_NONE;
            jobFinished = false;
            jobResult = "";
        } else if (jobType != JOB_NONE) {
            request->send(200, "application/json", "{\"status\":\"pending\"}");
        } else {
            request->send(404, "application/json", "{\"status\":\"none\"}");
        }
    });

    // API: Add station
    server.on("/api/stations", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (request->hasParam("id", true) && request->hasParam("name", true)) {
            if (stationCount >= MAX_STATIONS) {
                request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Max stations reached\"}");
                return;
            }
            String id = request->getParam("id", true)->value();
            // Check for duplicate
            for (int i = 0; i < stationCount; i++) {
                if (stations[i].id == id) {
                    request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Already added\"}");
                    return;
                }
            }
            stations[stationCount].id = id;
            stations[stationCount].name = request->getParam("name", true)->value();
            stations[stationCount].walkTime = 0;
            if (request->hasParam("walk_time", true)) {
                stations[stationCount].walkTime = request->getParam("walk_time", true)->value().toInt();
            }
            stationCount++;
            saveSettings();
            lastFetchTime = 0; // Trigger immediate refresh
            request->send(200, "application/json", "{\"ok\":true}");
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing id or name\"}");
        }
    });

    // API: Remove station
    server.on("/api/stations/remove", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (request->hasParam("id", true)) {
            String id = request->getParam("id", true)->value();
            int found = -1;
            for (int i = 0; i < stationCount; i++) {
                if (stations[i].id == id) { found = i; break; }
            }
            if (found >= 0) {
                for (int i = found; i < stationCount - 1; i++) {
                    stations[i] = stations[i + 1];
                }
                stationCount--;
                if (activeStationIdx >= stationCount) activeStationIdx = 0;
                saveSettings();
                request->send(200, "application/json", "{\"ok\":true}");
            } else {
                request->send(404, "application/json", "{\"ok\":false,\"msg\":\"Not found\"}");
            }
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing id\"}");
        }
    });

    // API: Update station walk time
    server.on("/api/stations/walktime", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (request->hasParam("id", true) && request->hasParam("walk_time", true)) {
            String id = request->getParam("id", true)->value();
            int wt = request->getParam("walk_time", true)->value().toInt();
            if (wt < 0) wt = 0;
            if (wt > 30) wt = 30;
            for (int i = 0; i < stationCount; i++) {
                if (stations[i].id == id) {
                    stations[i].walkTime = wt;
                    saveSettings();
                    lastFetchTime = 0; // Trigger refresh
                    request->send(200, "application/json", "{\"ok\":true}");
                    return;
                }
            }
            request->send(404, "application/json", "{\"ok\":false,\"msg\":\"Station not found\"}");
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing id or walk_time\"}");
        }
    });

    // Settings GET
    server.on("/api/settings", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        JsonDocument doc;
        doc["dep_count"] = depCountSetting;
        doc["scroll_enabled"] = scrollEnabled;
        doc["scroll_speed"] = scrollSpeedSetting;
        doc["sleep_enabled"] = sleepEnabled;
        doc["sleep_start"] = sleepStartHour;
        doc["sleep_end"] = sleepEndHour;
        doc["brightness"] = brightnessSetting;
        doc["api_host"] = apiHost;
        doc["filter_suburban"] = filters.suburban;
        doc["filter_subway"] = filters.subway;
        doc["filter_tram"] = filters.tram;
        doc["filter_bus"] = filters.bus;
        doc["filter_ferry"] = filters.ferry;
        doc["filter_express"] = filters.express;
        doc["filter_regional"] = filters.regional;
        doc["auth_enabled"] = authEnabled;
        // Never echo the password back, even to an already-authenticated caller.
        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });

    // Settings POST
    server.on("/api/settings", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        bool changed = false;
        if (request->hasParam("dep_count", true)) {
            int val = request->getParam("dep_count", true)->value().toInt();
            if (val >= 1 && val <= 15) {
                depCountSetting = val;
                changed = true;
            }
        }
        if (request->hasParam("scroll_enabled", true)) {
            scrollEnabled = request->getParam("scroll_enabled", true)->value() == "1";
            changed = true;
        }
        if (request->hasParam("scroll_speed", true)) {
            int val = request->getParam("scroll_speed", true)->value().toInt();
            if (val >= 1000 && val <= 10000) {
                scrollSpeedSetting = val;
                changed = true;
            }
        }
        if (request->hasParam("sleep_enabled", true)) {
            sleepEnabled = request->getParam("sleep_enabled", true)->value() == "1";
            changed = true;
        }
        if (request->hasParam("sleep_start", true)) {
            int val = request->getParam("sleep_start", true)->value().toInt();
            if (val >= 0 && val <= 23) {
                sleepStartHour = val;
                changed = true;
            }
        }
        if (request->hasParam("sleep_end", true)) {
            int val = request->getParam("sleep_end", true)->value().toInt();
            if (val >= 0 && val <= 23) {
                sleepEndHour = val;
                changed = true;
            }
        }
        if (request->hasParam("brightness", true)) {
            int val = request->getParam("brightness", true)->value().toInt();
            if (val >= 5 && val <= 255) {
                brightnessSetting = val;
                matrix->setBrightness8(brightnessSetting);
                changed = true;
            }
        }
        if (request->hasParam("api_host", true)) {
            String val = request->getParam("api_host", true)->value();
            // Only allow known safe hosts
            if (val == "v6.bvg.transport.rest" || val == "v6.vbb.transport.rest") {
                apiHost = val;
                lastFetchTime = 0; // Trigger immediate re-fetch
                changed = true;
            }
        }
        // Transport filters — each is optional and independent, same as the
        // web app's checkboxes. Any of them changing should refetch.
        struct { const char* param; bool* field; } filterParams[] = {
            { "filter_suburban", &filters.suburban },
            { "filter_subway",   &filters.subway   },
            { "filter_tram",     &filters.tram     },
            { "filter_bus",      &filters.bus      },
            { "filter_ferry",    &filters.ferry    },
            { "filter_express",  &filters.express  },
            { "filter_regional", &filters.regional }
        };
        for (auto& f : filterParams) {
            if (request->hasParam(f.param, true)) {
                *f.field = request->getParam(f.param, true)->value() == "1";
                lastFetchTime = 0;
                changed = true;
            }
        }
        // Security: a blank auth_password is ignored rather than clearing the
        // stored one — there is no way to "empty" it, only replace it. Handled
        // before auth_enabled below so submitting both together (typical portal
        // flow: type a password, tick "enabled", save) enables in one request.
        if (request->hasParam("auth_password", true)) {
            String val = request->getParam("auth_password", true)->value();
            if (val.length() > 0) {
                authPassword = val;
                changed = true;
            }
        }
        if (request->hasParam("auth_enabled", true)) {
            bool wantEnabled = request->getParam("auth_enabled", true)->value() == "1";
            if (!wantEnabled) {
                authEnabled = false;
                changed = true;
            } else if (authPassword.length() > 0) {
                authEnabled = true;
                changed = true;
            } else {
                request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Set a password before enabling\"}");
                return;
            }
        }
        if (changed) {
            saveSettings();
            request->send(200, "application/json", "{\"ok\":true}");
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"No valid params\"}");
        }
    });

