jako-dev/bvg-display/esp32/src/main.cpp
    // API: Factory reset
    server.on("/api/factory-reset", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        request->send(200, "application/json", "{\"ok\":true,\"msg\":\"Factory reset. Rebooting...\"}");
        pendingFactoryReset = true;
        pendingRebootAt = millis() + REBOOT_DELAY;
    });

    // API: Check for firmware update (GitHub releases).
    // Queued like the station search — the client polls /api/job for the result.
    server.on("/api/firmware/check", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (WiFi.status() != WL_CONNECTED) {
            request->send(503, "application/json", "{\"error\":\"WiFi not connected\"}");
            return;
        }
        if (jobType != JOB_NONE) {
            request->send(429, "application/json", "{\"error\":\"Busy, try again\"}");
            return;
        }
        jobResult = "";
        jobHttpCode = 0;
        jobFinished = false;
        jobType = JOB_FIRMWARE_CHECK;
        request->send(202, "application/json", "{\"status\":\"pending\"}");
    });

    // API: OTA update from URL (GitHub release asset)
    server.on("/api/firmware/update", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        if (!request->hasParam("url", true)) {
            request->send(400, "application/json", "{\"error\":\"Missing url param\"}");
            return;
        }
        String url = request->getParam("url", true)->value();
        // Only allow downloads from GitHub
        if (!url.startsWith("https://github.com/") && !url.startsWith("https://objects.githubusercontent.com/")) {
            request->send(400, "application/json", "{\"error\":\"URL must be from github.com\"}");
            return;
        }

        request->send(200, "application/json", "{\"ok\":true,\"msg\":\"Starting OTA update...\"}");

        // Perform OTA in a delayed task to allow response to be sent
        static String otaUrl;
        otaUrl = url;
        xTaskCreatePinnedToCore([](void* param) {
            delay(500); // Let HTTP response finish
            HTTPClient http;
            http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
            http.begin(otaUrl);
            http.setTimeout(30000);
            http.addHeader("User-Agent", "ESP32-Abfahrtsmonitor");
            int httpCode = http.GET();

            if (httpCode != 200) {
                Serial.printf("[OTA] Download failed, HTTP %d\n", httpCode);
                http.end();
                vTaskDelete(NULL);
                return;
            }

            int contentLength = http.getSize();
            if (contentLength <= 0) {
                Serial.println("[OTA] Invalid content length");
                http.end();
                vTaskDelete(NULL);
                return;
            }

            WiFiClient* stream = http.getStreamPtr();

            // Validate the ESP32 firmware magic byte. peek() returns -1 while
            // the socket buffer is still empty, so wait for the first byte
            // instead of rejecting a perfectly good image.
            unsigned long waitStart = millis();
            while (stream->available() < 1 && millis() - waitStart < 10000) {
                delay(10);
            }
            if (stream->peek() != 0xE9) {
                Serial.println("[OTA] Invalid firmware (bad magic byte)");
                http.end();
                vTaskDelete(NULL);
                return;
            }

            if (!Update.begin(contentLength)) {
                Serial.printf("[OTA] Not enough space: %d\n", contentLength);
                http.end();
                vTaskDelete(NULL);
                return;
            }

            Serial.printf("[OTA] Starting update, %d bytes\n", contentLength);
            size_t written = Update.writeStream(*stream);
            if (written == (size_t)contentLength) {
                Serial.println("[OTA] Written successfully");
            } else {
                Serial.printf("[OTA] Written only %d/%d\n", written, contentLength);
            }

            if (Update.end()) {
                if (Update.isFinished()) {
                    Serial.println("[OTA] Update success! Rebooting...");
                    delay(500);
                    ESP.restart();
                } else {
                    Serial.println("[OTA] Update not finished");
                }
            } else {
                Serial.printf("[OTA] Update error: %s\n", Update.errorString());
            }

            http.end();
            vTaskDelete(NULL);
        }, "ota_task", 8192, NULL, 1, NULL, 0);
    });

    // API: Manual firmware upload
    server.on("/api/firmware/upload", HTTP_POST,
        // Response handler (called after upload completes)
        [](AsyncWebServerRequest* request) {
            // If auth failed, the upload handler below already sent 401 via
            // checkAuth()/requestAuthentication() — sending a second response
            // to the same request is unsafe, so just stop here.
            if (!otaUploadAuthorized) return;
            if (Update.hasError()) {
                request->send(500, "application/json", "{\"ok\":false,\"msg\":\"" + String(Update.errorString()) + "\"}");
            } else {
                request->send(200, "application/json", "{\"ok\":true,\"msg\":\"Update successful! Rebooting...\"}");
                delay(500);
                ESP.restart();
            }
        },
        // Upload handler (called for each chunk)
        [](AsyncWebServerRequest* request, const String& filename, size_t index, uint8_t* data, size_t len, bool final) {
            if (index == 0) {
                // Checked once per upload, before a single byte is written to
                // flash — never trust a later chunk just because index==0 passed.
                otaUploadAuthorized = checkAuth(request);
                if (!otaUploadAuthorized) return;

