jako-dev/bvg-display/esp32/src/main.cpp
                Serial.printf("[OTA] Upload start: %s\n", filename.c_str());
                // Validate magic byte
                if (len > 0 && data[0] != 0xE9) {
                    Serial.println("[OTA] Invalid firmware file");
                    Update.abort();
                    return;
                }
                if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
                    Serial.printf("[OTA] Begin failed: %s\n", Update.errorString());
                    return;
                }
            }
            if (!otaUploadAuthorized) return;
            if (Update.isRunning()) {
                if (Update.write(data, len) != len) {
                    Serial.printf("[OTA] Write failed: %s\n", Update.errorString());
                }
            }
            if (final) {
                if (Update.end(true)) {
                    Serial.printf("[OTA] Upload complete: %u bytes\n", index + len);
                } else {
                    Serial.printf("[OTA] Upload end failed: %s\n", Update.errorString());
                }
            }
        }
    );

    // API: Get firmware version
    server.on("/api/firmware/version", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!checkAuth(request)) return;
        request->send(200, "application/json", "{\"version\":\"" + String(FW_VERSION) + "\"}");
    });

    // Catch-all for captive portal
    server.onNotFound([](AsyncWebServerRequest* request) {
        request->redirect("/");
    });

    server.begin();
    Serial.println("Web server started");
}

// ===== Deferred Network Jobs =====
// Run from loop() so the AsyncTCP task is never blocked by a TLS handshake.
void processPendingJob() {
    if (jobType == JOB_NONE) return;

    if (jobFinished) {
        // Nobody collected the result (page closed mid-request) — drop it so
        // the next search isn't rejected as "busy" forever.
        if (millis() - jobFinishedAt > JOB_RESULT_TTL) {
            jobType = JOB_NONE;
            jobFinished = false;
            jobResult = "";
        }
        return;
    }

    switch (jobType) {
        case JOB_STATION_SEARCH: runStationSearch(); break;
        case JOB_FIRMWARE_CHECK: runFirmwareCheck(); break;
        default: break;
    }
    jobFinishedAt = millis();
    jobFinished = true;
}

void runStationSearch() {
    if (WiFi.status() != WL_CONNECTED) {
        jobHttpCode = 503;
        jobResult = "null";
        return;
    }

    HTTPClient http;
    String url = "https://" + apiHost + "/locations?query=" + urlEncode(jobParam) +
                 "&results=5&stops=true&addresses=false&poi=false&pretty=false";
    http.begin(url);
    http.setTimeout(8000);
    jobHttpCode = http.GET();

    if (jobHttpCode == 200) {
        // Keep only the fields the portal needs — the raw response carries a
        // lot of geo/product data that would waste both heap and bandwidth.
        JsonDocument filter;
        JsonObject item = filter.add<JsonObject>();
        item["id"] = true;
        item["name"] = true;
        item["type"] = true;

        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, http.getStream(),
                                                  DeserializationOption::Filter(filter));
        if (err) {
            jobHttpCode = 500;
            jobResult = "null";
        } else {
            serializeJson(doc, jobResult);
        }
    } else {
        jobResult = "null";
    }
    http.end();
}

void runFirmwareCheck() {
    if (WiFi.status() != WL_CONNECTED) {
        jobHttpCode = 503;
        jobResult = "null";
        return;
    }

    HTTPClient http;
    http.begin(GITHUB_RELEASE_URL);
    http.setTimeout(10000);
    http.addHeader("User-Agent", "ESP32-Abfahrtsmonitor");
    int code = http.GET();
    if (code != 200) {
        jobHttpCode = 502;
        jobResult = "null";
        http.end();
        return;
    }

    // The GitHub release payload is tens of kilobytes; filter it down while
    // streaming so it never has to fit in RAM as a String.
    JsonDocument filter;
    filter["tag_name"] = true;
    filter["name"] = true;
    filter["body"] = true;
    JsonObject asset = filter["assets"].add<JsonObject>();
    asset["name"] = true;
    asset["browser_download_url"] = true;

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, http.getStream(),
                                              DeserializationOption::Filter(filter));
    http.end();

    if (err) {
        jobHttpCode = 500;
        jobResult = "null";
        return;
    }

    String tagName = doc["tag_name"] | "";
    String downloadUrl = "";
    for (JsonObject a : doc["assets"].as<JsonArray>()) {
        String assetName = a["name"].as<String>();
        if (assetName == FW_ASSET_NAME) {
            downloadUrl = a["browser_download_url"].as<String>();
            break;
        }
    }

    JsonDocument resp;
    resp["current_version"] = FW_VERSION;
    resp["latest_version"] = tagName;
    resp["release_name"] = doc["name"] | tagName;
    resp["release_notes"] = doc["body"] | "";
    resp["download_url"] = downloadUrl;
    resp["update_available"] =
        (tagName != "" && tagName != "v" + String(FW_VERSION) && tagName != String(FW_VERSION));

    jobHttpCode = 200;
    serializeJson(resp, jobResult);
}

// ===== BVG API =====
void fetchDepartures() {
    if (WiFi.status() != WL_CONNECTED || stationCount == 0) return;

    // Keep the previous departures on screen until at least one station has
    // answered. Clearing up front meant a single failed poll blanked the panel.
    bool anySuccess = false;

    for (int s = 0; s < stationCount; s++) {
        String url = "https://" + apiHost + "/stops/" + urlEncode(stations[s].id) +
                     "/departures?duration=" + String(BVG_DEPARTURE_DURATION + stations[s].walkTime) +
                     "&results=" + String(depCountSetting) + "&pretty=false&language=de" +
                     filterQueryParams();

        HTTPClient http;
        http.begin(url);
        http.setTimeout(10000);
        int httpCode = http.GET();

        if (httpCode == 200) {
            if (!anySuccess) {
                departureCount = 0;
                anySuccess = true;
            }
            int countBefore = departureCount;
            parseDeparturesAppend(http.getStream());

            // Filter this station's departures by its walk time
            if (stations[s].walkTime > 0) {
                int writeIdx = countBefore;
                for (int i = countBefore; i < departureCount; i++) {
                    if (departures[i].minutesUntil >= stations[s].walkTime) {
                        if (writeIdx != i) departures[writeIdx] = departures[i];
                        writeIdx++;
                    }
                }
                departureCount = writeIdx;
            }
            Serial.println("Station " + stations[s].name + ": OK (" + String(departureCount - countBefore) + " deps)");
        } else if (httpCode == 429) {
            Serial.println("Rate limited for " + stations[s].name + ", skipping remaining");
            http.end();
            break; // Don't hammer the API
        } else {
            Serial.println("API error for " + stations[s].name + ": " + String(httpCode));
        }
        http.end();
        esp_task_wdt_reset();  // multi-station polls can approach the WDT window

        // Small delay between multi-station fetches to avoid rate limiting
        if (s < stationCount - 1) delay(200);
    }

    if (!anySuccess) {
        Serial.println("All stations failed — keeping previous departures");
        return;
    }

    // Sort merged departures by minutesUntil
    sortDepartures();
    scrollOffset = 0;
    lastSuccessfulFetch = millis();
    Serial.println("Total merged departures: " + String(departureCount));
}

void parseDeparturesAppend(Stream& stream) {
    // Parse straight from the socket and keep only the fields that get drawn.
    // The full response for several stations is far larger than the free heap,
    // so buffering it into a String could fail outright.
    JsonDocument filter;
    JsonObject dep = filter["departures"].add<JsonObject>();
    dep["direction"] = true;
    dep["when"] = true;
    dep["plannedWhen"] = true;
    dep["cancelled"] = true;
    dep["delay"] = true;
    dep["line"]["name"] = true;
    dep["line"]["product"] = true;

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, stream, DeserializationOption::Filter(filter));
    if (err) {
        Serial.println("JSON parse error: " + String(err.c_str()));
        return;
    }

    JsonArray deps = doc["departures"].as<JsonArray>();
    if (deps.isNull()) return;

    for (JsonObject d : deps) {
        if (departureCount >= BVG_MAX_DEPARTURES) break;

