jako-dev/bvg-display/esp32/src/main.cpp
        Departure& out = departures[departureCount];
        out.lineName = d["line"]["name"].as<String>();
        out.direction = d["direction"].as<String>();
        out.product = d["line"]["product"].as<String>();
        out.cancelled = d["cancelled"] | false;
        out.delaySeconds = d["delay"] | 0;

        // Calculate minutes until departure
        const char* whenStr = d["when"] | (const char*)nullptr;
        if (!whenStr) whenStr = d["plannedWhen"] | (const char*)nullptr;

        out.minutesUntil = -1;
        if (whenStr) {
            // Parse ISO 8601: "2026-05-06T13:09:00+02:00"
            struct tm tmv = {};
            int tzHour = 0, tzMin = 0;
            char tzSign = '+';
            int parsed = sscanf(whenStr, "%d-%d-%dT%d:%d:%d%c%d:%d",
                   &tmv.tm_year, &tmv.tm_mon, &tmv.tm_mday,
                   &tmv.tm_hour, &tmv.tm_min, &tmv.tm_sec,
                   &tzSign, &tzHour, &tzMin);

            if (parsed >= 6) {
                tmv.tm_year -= 1900;
                tmv.tm_mon -= 1;
                tmv.tm_isdst = 0;

                // mktime() reads tmv as local time, but the string carries its
                // own offset. Undo the local offset, then apply the string's.
                time_t depEpoch = mktime(&tmv);
                struct tm check;
                localtime_r(&depEpoch, &check);
                depEpoch += check.tm_gmtoff; // Now it's as if tmv was UTC

                int tzOffsetSec = (tzHour * 3600 + tzMin * 60);
                if (tzSign == '+') depEpoch -= tzOffsetSec;
                else if (tzSign == '-') depEpoch += tzOffsetSec;

                time_t nowUtc;
                time(&nowUtc);

                out.minutesUntil = (int)((depEpoch - nowUtc) / 60);
                if (out.minutesUntil < 0) out.minutesUntil = 0;
            }
        }

        departureCount++;
    }
}

// Sort departures by minutesUntil (ascending)
void sortDepartures() {
    for (int i = 0; i < departureCount - 1; i++) {
        for (int j = i + 1; j < departureCount; j++) {
            if (departures[j].minutesUntil < departures[i].minutesUntil) {
                Departure tmp = departures[i];
                departures[i] = departures[j];
                departures[j] = tmp;
            }
        }
    }
    // Trim to max
    if (departureCount > BVG_MAX_DEPARTURES) {
        departureCount = BVG_MAX_DEPARTURES;
    }
}

// ===== Display Rendering =====
void renderDisplay() {
    matrix->clearScreen();

    if (departureCount == 0) {
        renderTextCentered("Warte auf Daten...", matrix->color565(255, 204, 0));
        return;
    }

    // Stale data warning: blinking dot in top-right corner
    bool dataStale = (lastSuccessfulFetch > 0 && millis() - lastSuccessfulFetch > STALE_DATA_THRESHOLD);
    if (dataStale) {
        // Blink a red dot every 500ms
        if ((millis() / 500) % 2 == 0) {
            matrix->fillRect(MATRIX_WIDTH - 3, 0, 3, 3, matrix->color565(255, 0, 0));
        }
    }

    // Render up to DISPLAY_ROWS departures
    int rowHeight = 10;

    if (!scrollEnabled) {
        // Static mode: show first 3 departures only
        for (int i = 0; i < DISPLAY_ROWS && i < departureCount; i++) {
            renderDepartureRow(departures[i], i * rowHeight + 1);
        }
    } else {
        // Scroll mode
        for (int i = 0; i < DISPLAY_ROWS && i < departureCount; i++) {
            int depIdx = (scrollOffset + i) % departureCount;
            renderDepartureRow(departures[depIdx], i * rowHeight + 1);
        }

        // Advance scroll based on scrollSpeedSetting
        static int frameCount = 0;
        frameCount++;
        int framesPerScroll = scrollSpeedSetting / SCROLL_SPEED;
        if (frameCount >= framesPerScroll && departureCount > DISPLAY_ROWS) {
            scrollOffset = (scrollOffset + 1) % departureCount;
            frameCount = 0;
        }
    }
}

void renderDepartureRow(const Departure& dep, int y) {
    uint16_t lineColor = getLineColor(dep.product, dep.lineName);
    uint16_t white = matrix->color565(255, 255, 255);
    uint16_t yellow = matrix->color565(255, 204, 0);
    uint16_t red = matrix->color565(255, 0, 0);
    uint16_t green = matrix->color565(0, 255, 0);

    // Line badge background
    int badgeWidth = measureString(dep.lineName.c_str()) + 3;
    matrix->fillRect(0, y, badgeWidth, 8, lineColor);

    // Line name
    uint16_t textColor = white;
    drawString(matrix, dep.lineName.c_str(), 1, y + 1, textColor);

    // Time
    String timeStr;
    uint16_t timeColor;
    if (dep.cancelled) {
        timeStr = "X";
        timeColor = red;
    } else if (dep.minutesUntil <= 0) {
        timeStr = "jetzt";
        timeColor = green;
    } else if (dep.minutesUntil < 60) {
        timeStr = String(dep.minutesUntil) + "'";
        timeColor = (dep.delaySeconds > 120) ? red : yellow;
    } else {
        timeStr = String(dep.minutesUntil / 60) + "h";
        timeColor = yellow;
    }

    int timeX = MATRIX_WIDTH - measureString(timeStr.c_str()) - 1;
    drawString(matrix, timeStr.c_str(), timeX, y + 1, timeColor);

    // Direction fills whatever is left between badge and time. Sized from the
    // actual gap rather than a fixed 14 characters, and truncated on glyph
    // boundaries so a multi-byte character is never cut in half.
    int destX = badgeWidth + 2;
    int available = timeX - destX - 2;
    int maxGlyphs = available / FONT_CHAR_ADVANCE;
    uint16_t destColor = dep.cancelled ? matrix->color565(100, 100, 100) : white;
    drawString(matrix, truncateUtf8(dep.direction, maxGlyphs).c_str(), destX, y + 1, destColor);
}

void renderTextCentered(const char* text, uint16_t color) {
    int w = measureString(text);
    int x = (MATRIX_WIDTH - w) / 2;
    int y = (MATRIX_HEIGHT - 7) / 2;
    drawString(matrix, text, x, y, color);
}

void renderSetupScreen() {
    static unsigned long lastBlink = 0;
    static bool showIP = true;
    
    matrix->clearScreen();
    
    uint16_t yellow = matrix->color565(255, 204, 0);
    uint16_t cyan = matrix->color565(0, 200, 255);
    
    drawString(matrix, "Abfahrtsmonitor", 26, 2, yellow);
    
    if (millis() - lastBlink > 2000) {
        showIP = !showIP;
        lastBlink = millis();
    }
    
    if (showIP) {
        String ip = WiFi.softAPIP().toString();
        drawString(matrix, ip.c_str(), 10, 14, cyan);
    } else {
        drawString(matrix, "WiFi: Abfahrtsmonitor", 2, 14, cyan);
    }
    
