jako-dev/bvg-display/esp32/src/main.cpp
    drawString(matrix, "Setup via Browser", 5, 24, matrix->color565(150, 150, 150));
}

// ===== Line Colors =====
uint16_t getLineColor(const String& product, const String& lineName) {
    String name = lineName;
    name.toLowerCase();
    
    // Specific U-Bahn colors
    if (name == "u1") return matrix->color565(125, 173, 76);
    if (name == "u2") return matrix->color565(218, 66, 30);
    if (name == "u3") return matrix->color565(0, 122, 91);
    if (name == "u4") return matrix->color565(240, 215, 34);
    if (name == "u5") return matrix->color565(126, 83, 48);
    if (name == "u6") return matrix->color565(140, 109, 171);
    if (name == "u7") return matrix->color565(82, 141, 186);
    if (name == "u8") return matrix->color565(34, 79, 134);
    if (name == "u9") return matrix->color565(243, 121, 29);
    
    // Specific S-Bahn colors
    if (name == "s1") return matrix->color565(222, 77, 164);
    if (name == "s2" || name == "s25" || name == "s26") return matrix->color565(0, 95, 39);
    if (name == "s3") return matrix->color565(0, 96, 170);
    if (name == "s41") return matrix->color565(162, 59, 30);
    if (name == "s42") return matrix->color565(194, 106, 55);
    if (name == "s5") return matrix->color565(255, 89, 0);
    if (name == "s7" || name == "s75") return matrix->color565(119, 96, 176);
    if (name == "s8" || name == "s85") return matrix->color565(85, 168, 34);
    if (name == "s9") return matrix->color565(139, 28, 98);
    
    // Generic product colors
    if (product == "suburban") return matrix->color565(0, 141, 79);
    if (product == "subway") return matrix->color565(0, 96, 170);
    if (product == "tram") return matrix->color565(190, 20, 20);
    if (product == "bus") return matrix->color565(155, 39, 144);
    if (product == "ferry") return matrix->color565(0, 137, 180);
    if (product == "express") return matrix->color565(100, 100, 100);
    if (product == "regional") return matrix->color565(227, 6, 19);
    
    return matrix->color565(255, 204, 0); // default yellow
}

// ===== Settings Persistence =====
void loadSettings() {
    prefs.begin(PREFS_NAMESPACE, true);
    wifiSSID = prefs.getString("ssid", "");
    wifiPassword = prefs.getString("pass", "");
    stationCount = prefs.getInt("stCount", 0);
    
    depCountSetting = prefs.getInt("depCount", 6);
    scrollEnabled = prefs.getBool("scrollOn", false);
    scrollSpeedSetting = prefs.getInt("scrollSpd", 3000);
    sleepEnabled = prefs.getBool("sleepOn", false);
    sleepStartHour = prefs.getInt("sleepStart", 22);
    sleepEndHour = prefs.getInt("sleepEnd", 6);
    brightnessSetting = prefs.getInt("brightness", 80);
    apiHost = prefs.getString("apiHost", BVG_API_HOST_DEFAULT);

    filters.suburban = prefs.getBool("fSuburban", true);
    filters.subway   = prefs.getBool("fSubway", true);
    filters.tram     = prefs.getBool("fTram", true);
    filters.bus      = prefs.getBool("fBus", true);
    filters.ferry    = prefs.getBool("fFerry", true);
    filters.express  = prefs.getBool("fExpress", true);
    filters.regional = prefs.getBool("fRegional", true);

    authEnabled = prefs.getBool("authOn", false);
    authPassword = prefs.getString("authPass", "");

    for (int i = 0; i < stationCount && i < MAX_STATIONS; i++) {
        stations[i].id = prefs.getString(("st_id_" + String(i)).c_str(), "");
        stations[i].name = prefs.getString(("st_nm_" + String(i)).c_str(), "");
        stations[i].walkTime = prefs.getInt(("st_wt_" + String(i)).c_str(), 0);
    }
    prefs.end();
    
    Serial.println("Loaded " + String(stationCount) + " stations, SSID: " + wifiSSID);
}

void saveSettings() {
    prefs.begin(PREFS_NAMESPACE, false);
    prefs.putString("ssid", wifiSSID);
    prefs.putString("pass", wifiPassword);
    prefs.putInt("stCount", stationCount);
    prefs.putInt("depCount", depCountSetting);
    prefs.putBool("scrollOn", scrollEnabled);
    prefs.putInt("scrollSpd", scrollSpeedSetting);
    prefs.putBool("sleepOn", sleepEnabled);
    prefs.putInt("sleepStart", sleepStartHour);
    prefs.putInt("sleepEnd", sleepEndHour);
    prefs.putInt("brightness", brightnessSetting);
    prefs.putString("apiHost", apiHost);

    prefs.putBool("fSuburban", filters.suburban);
    prefs.putBool("fSubway", filters.subway);
    prefs.putBool("fTram", filters.tram);
    prefs.putBool("fBus", filters.bus);
    prefs.putBool("fFerry", filters.ferry);
    prefs.putBool("fExpress", filters.express);
    prefs.putBool("fRegional", filters.regional);

    prefs.putBool("authOn", authEnabled);
    prefs.putString("authPass", authPassword);

    for (int i = 0; i < stationCount; i++) {
        prefs.putString(("st_id_" + String(i)).c_str(), stations[i].id);
        prefs.putString(("st_nm_" + String(i)).c_str(), stations[i].name);
        prefs.putInt(("st_wt_" + String(i)).c_str(), stations[i].walkTime);
    }
    prefs.end();
}

void factoryReset() {
    Serial.println("[RESET] Factory reset triggered!");
    matrix->clearScreen();
    renderTextCentered("RESET...", matrix->color565(255, 0, 0));
    delay(1000);
    prefs.begin(PREFS_NAMESPACE, false);
    prefs.clear();
    prefs.end();
    delay(500);
    ESP.restart();
}

// ===== Utility =====
String urlEncode(const String& str) {
    String encoded = "";
    for (unsigned int i = 0; i < str.length(); i++) {
        char c = str[i];
        if (isalnum(c) || c == '-' || c == '_' || c == '.' || c == '~') {
            encoded += c;
        } else {
            char buf[4];
            snprintf(buf, sizeof(buf), "%%%02X", (unsigned char)c);
            encoded += buf;
        }
    }
    return encoded;
}
